---
kind: property
id: P:Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.Abbreviation
source: html/0db5b2ff-f375-c8a9-135f-c611fa1e47af.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalLoadClassification.Abbreviation Property

The abbreviation of the load classification name

## Syntax (C#)
```csharp
public string Abbreviation { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: abbreviation is an empty string or contains only whitespace.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null